window.__buddhism_sutra = {
  "text": `
南无阿弥多婆夜 
ná mó ā mí duō pó yè

哆他伽多夜  哆地夜他 
duō tuō qié duō yè  duō dì yè tuō


阿弥利都婆毗 阿弥利哆
ā mí lì dū pó pí ā mí lì duō
 

悉耽婆毗 阿弥唎哆 
xī dān pó pí ā mí lì duō

毗迦兰帝  阿弥唎哆 
pí jiā lán dì ā mí lì duō

毗迦兰多 伽弥腻
pí jiā lán duō qié mí ní

伽伽那 枳多迦利
qié qié nuó zhǐ duō jiā lì

娑婆诃
suō pó hē
  `,
  "tip": `
往生咒是佛教净土宗信徒经常持诵的一种咒语，亦用于超度亡灵。持咒的方法和利益：如要持诵往生咒，应该清净三业，沐浴，漱口，至诚一心，在佛前燃香，长跪合掌，日夜各诵念二十一遍。若此就可消灭四重罪（杀生、偷盗、邪淫、妄语）、五逆罪（杀父、杀母、杀阿罗汉、出佛身血、破和合僧）、十种恶业（杀生、偷盗、邪淫、妄语、两舌、恶口、绮语、贪爱、憎恨、愚痴），连毁谤大乘经典的罪都能消除。现世一切所求都能如意获得，不被邪恶鬼神所迷惑。若能持诵二十万遍，就会萌生智慧的苗芽。若念三十万遍，就能亲自看见阿弥陀佛。
  `,
}




 




