window.__buddhism_sutra = {
  "text": `南无喝啰怛那哆啰夜耶 南无阿唎耶 
婆卢羯帝烁钵啰耶 菩提萨埵婆耶 
摩诃萨埵婆耶 摩诃迦卢尼迦耶 
唵 萨皤啰罚曳 数怛那怛写 
南无悉吉利埵伊蒙阿利耶 
婆卢吉帝室佛啰楞驮婆 
南无那啰谨墀 醯唎摩诃皤哆沙咩 
萨婆阿他豆输朋 阿逝孕 
萨婆萨哆那摩婆萨多 那摩婆伽 摩罚特豆 
怛侄他 唵阿婆卢醯 
卢迦帝 迦罗帝 夷醯唎 摩诃菩提萨埵 
萨婆萨婆 摩啰摩啰 摩醯摩醯唎驮孕 俱卢俱卢
羯蒙 度卢度卢罚阇耶帝 摩诃罚阇耶帝 陀罗陀罗 
地利尼 室佛啰耶 遮啰遮啰 
么么罚摩啰 穆帝隶 伊醯伊醯 
室那室那 阿啰参佛啰舍利 
罚娑罚嘇 佛啰舍耶 
呼卢呼卢摩啰 呼卢呼卢醯利 
娑啰娑啰 悉唎悉唎 
苏嚧苏嚧 菩提夜菩提夜 菩驮夜菩驮夜 弥帝利夜 
那啰谨墀 地利瑟尼那 婆夜摩那娑婆诃 悉陀夜 娑婆诃 
摩诃悉陀夜 娑婆诃 悉陀喻艺 室皤啰夜 娑婆诃 
那啰谨墀 娑婆诃 摩啰那啰 娑婆诃 
悉啰僧阿穆佉耶 娑婆诃 娑婆摩诃阿悉陀夜 娑婆诃 
者吉啰阿悉陀夜 娑婆诃 
波陀摩羯悉陀夜 娑婆诃 
那啰谨墀皤伽啰耶 娑婆诃 
摩婆利胜羯啰耶 娑婆诃 
南无喝啰怛那哆啰夜耶 南无阿唎耶 
婆嚧吉帝 烁皤啰夜 娑婆诃 
唵 悉殿都 漫多啰 跋陀耶 娑婆诃`,
  "tip": `皈依三宝，皈依大悲渡世的观世音菩萨，世间感受一切恐怖病苦的众生，要誓愿宣说广大圆满无碍大悲救苦救难的真言，要看破生死烦恼，了悟真实光明，皈依于大慈大悲、随心自在的观世菩萨。祈求一切圆满，不受一切鬼卒的侵害，皈命于为观世音菩萨请说广大圆满无碍大悲心陀罗尼的本尊－千光王静住如来。能得清净圆明的光辉，能除无明罣碍的烦恼，要修得无上的功德，方不致沈沦在无边执着的苦海之中。
大慈大悲的观世音菩萨，常以诸佛菩萨的化身，悠游于大千世界，密放神通，随缘化渡，一如菩萨显化的狮子王法身，引导有缘众生远离罪恶，忘却生死烦恼，皈向真实光明。大慈大悲的观世音菩萨以清净无垢圣洁莲华的法身，顺时顺教，使众生了悟佛因，大慈大悲的观世音菩萨，对于流布毒害众生的贪、瞋、痴三魔，更以严峻大力的法身予以降伏，使修持众生得能清净，菩萨更以清净莲华，显现慈悲，扬洒甘露，救渡众生脱离苦难。只是娑婆世界众生，常习于十恶之苦，不知自觉，不肯脱离，使行诸利乐的菩萨，常要忍受怨嫉烦恼。然而菩萨慈悲，为救众生痴迷，复显化明王法身，以无上智慧破解烦恼业障，远离一切恐怖危难。大慈大悲观世音菩萨显化之诸般法相，常在众生之中，随缘随现，使众生忆佛念佛，迷途知悟。
为使众生早日皈依欢喜圆满，无为虚空的涅盘世界，菩萨复行大慈大悲的誓愿，手持宝幢，大放光明，渡化众生通达一切法门，使众生随行相应，自由自在得到无上成就。菩萨的无量佛法，广被大众，恰似法螺传声，使诸天善神均现欢喜影相，亦使众生于听闻佛法之后，能罪障灭除，各得成就。不管是猪面、狮面，不管是善面、恶面，凡能受此指引，都能得诸成就，即使住世之黑色尘魔，菩萨亦以显化之大勇法相，持杖指引，渡其皈依三宝。

南无大慈大悲圣观世音菩萨，愿诚心诵持此真言者，皆得涅盘。`,
}