window.__buddhism_sutra = {
  "text": `
ong
嗡

da lie
大咧

du da lie 
度大咧

du lie suo ha
度咧蘇哈
  `,
  "tip": `
绿度母为观世音菩萨的化身。度母，梵名Tara，全称圣救度佛母，我国古代称多罗菩萨、多罗观音，共有二十一尊，皆为观世音菩萨之化身。绿度母即二十一尊度母之一，此尊现少女相，全身绿色，一面二臂，现慈悲相。头戴五佛宝冠，身佩各种珠宝，着各色天衣，下身重裙，以示庄严；坐菩萨座于莲花月轮上，右足呈蹍踏状，左足踡屈。右手向外置于右膝上，作施愿印，持乌巴拉花，左手置于胸前，亦持乌巴拉花。修持此尊密法，能断生死轮回，消除一切魔障、业障、病苦等，并能消灾、增福、延寿、广开智慧，凡有所求，无不如愿成就，且命终往生极乐世界。
绿救度母，有二十一个化身。是值得修密宗的人敬仰的大菩萨，最容易亲近，也最容易得到相应的，有些人一生专修「绿度母」法，得到很大的智慧，众生只要诚意称念她的名字，持「绿度母」的心咒，修行自能得果。 绿度母为廿一尊度母之主，绿度母咒乃廿一度母之根本咒。如果常勤念诵，就能逐渐断除轮回之根源。修持绿度母法门成就者，得免除一切魔障、瘟疫病苦，消除一切水火刀兵盗俚葹碾。并能增长福慧、权威、寿命。凡有所求时，无不如愿，命终时往生极乐。修习本法门成就者，得除一切罪业，消灭魔障，能救一切灾难，速得无量圆满功德，而且无子息者，求男得男，求女得女，求财得财，长寿富贵皆能如愿，其功德利益广大无量不可思议。当今之世，修此法之成效最为迅速，加持力大胜过一切法。乃满愿及除障最深奥的法门，能阻止恶咒、自杀、疯癫、争斗、恶兆、梦魇、疾病、传染病及牲畜之病等一切损伤，破除年、月、日、时之不祥。若想满足心中愿望，消除心中恐惧，无有比度母更殊胜之法门，过去在印度及西藏修此法门之成就者及得到祥瑞征兆之例子甚多，至今仍广为流传。
  `,
}