window.__buddhism_sutra = {
  "text": `
  南 无 蕯 怛 他
  苏 伽 多 耶
  阿 啰 诃 帝
  三 藐 三 菩 陀 写
  蕯 怛 他
  佛 陀 俱 胝 瑟 尼 钐
  南 无 蕯 婆
  勃 陀 勃 地
  蕯 跢 鞞 弊
  南 无 蕯 多 南
  三 藐 三 菩 陀
  俱 知 南
  娑 舍 啰 婆 迦
  僧 伽 喃
  南 无 庐 鸡 阿 罗 汉 跢 喃
  南 无 苏 庐 多 波 那 喃
  南 无 娑 羯 唎 陀 伽 弥 喃
  南 无 庐 鸡 三 藐 伽 跢 喃
  三 藐 伽 波 啰
  底 波 多 那 喃
  南 无 提 婆 离 瑟 赧
  南 无 悉 陀 耶
  毗 地 耶
  陀 啰 离 瑟 赧
  舍 波 奴
  揭 啰 诃
  娑 诃 娑 啰 摩 他 喃
  南 无 跋 啰 诃 摩 尼
  南 无 因 陀 啰 耶
  南 无 婆 伽 婆 帝
  庐 陀 啰 耶
  乌 摩 般 帝
  娑 醯 夜 耶
  南 无 婆 伽 婆 帝
  那 啰 野
  拏 耶
  盘 遮 摩 诃 三 慕 陀 啰
  南 无 悉 羯 唎 多 耶
  南 无 婆 伽 婆 帝
  摩 诃 迦 啰 耶
  地 唎 般 剌 那
  伽 啰 毗 陀 啰
  波 拏 迦 啰 耶
  阿 地 目 帝
  尸 摩 舍 那 泥
  婆 悉 泥
  摩 怛 唎 伽 拏
  南 无 悉 羯 唎 多 耶
  南 无 婆 伽 婆 帝
  多 他 伽 跢 俱 啰 耶
  南 无 般 头 摩 俱 啰 耶
  南 无 跋 阇 啰 俱 啰 耶
  南 无 摩 尼 俱 啰 耶
  南 无 伽 阇 俱 啰 耶
  南 无 婆 伽 婆 帝
  帝 唎 茶
  输 啰 西 那
  波 啰 诃 啰 拏 啰 阇 耶
  跢 他 伽 多 耶
  南 无 婆 伽 婆 帝
  南 无 阿 弥 多 婆 耶
  跢 他 伽 多 耶
  阿 啰 诃 帝
  三 藐 三 菩 陀 耶
  南 无 婆 伽 婆 帝
  阿 刍 鞞 耶
  跢 他 伽 多 耶
  阿 啰 诃 帝
  三 藐 三 菩 陀 耶
  南 无 婆 伽 婆 帝
  鞞 沙 阇 耶
  俱 庐 吠 柱 唎 耶
  般 啰 婆 啰 阇 耶
  跢 他 伽 多 耶
  南 无 婆 伽 婆 帝
  三 补 师 毖 多
  蕯 怜 捺 啰 剌 阇 耶
  跢 他 伽 多 耶
  阿 啰 诃 帝
  三 藐 三 菩 陀 耶
  南 无 婆 伽 婆 帝
  舍 鸡 野 母 那 曳
  跢 他 伽 多 耶
  阿 啰 诃 帝
  三 藐 三 菩 陀 耶
  南 无 婆 伽 婆 帝
  剌 怛 那 鸡 都 啰 阇 耶
  跢 他 伽 多 耶
  阿 啰 诃 帝
  三 藐 三 菩 陀 耶
  帝 瓢
  南 无 蕯 羯 唎 多
  翳 昙 婆 伽 婆 多
  蕯 怛 他 伽 都 瑟 尼 钐
  蕯 怛 多 般 怛 蓝
  南 无 阿 婆 啰 视 耽
  般 啰 帝
  扬 歧 啰
  蕯 啰 婆
  部 多 揭 啰 诃
  尼 羯 啰 诃
  揭 迦 啰 诃 尼
  跋 啰 毖 地 耶
  叱 陀 你
  阿 迦 啰
  密 唎 柱
  般 唎 怛 啰 耶
  儜 揭 唎
  蕯 啰 婆
  盘 陀 那
  目 叉 尼
  蕯 啰 婆
  突 瑟 咤
  突 悉 乏
  般 那 你
  伐 啰 尼
  赭 都 啰
  失 帝 南
  羯 啰 诃
  娑 诃 蕯 啰 若 阇
  毗 多 崩 娑 那 羯 唎
  阿 瑟 吒 冰 舍 帝 南
  那 叉 刹 怛 啰 若 阇
  波 啰 蕯 陀 那 羯 唎
  阿 瑟 吒 南
  摩 诃 羯 啰 诃 若 阇
  毗 多 崩 蕯 那 羯 唎
  蕯 婆 舍 都 嚧
  你 婆 啰 若 阇
  呼 蓝 突 悉 乏
  难 遮 那 舍 尼
  毖 沙 舍
  悉 怛 啰
  阿 吉 尼
  乌 陀 迦 啰 若 阇
  阿 般 啰 视 多 具 啰
  摩 诃 般 啰 战 持
  摩 诃 叠 多
  摩 诃 帝 阇
  摩 诃 税 多 阇 婆 啰
  摩 诃 跋 啰 盘 陀 啰
  婆 悉 你
  阿 唎 耶 多 啰
  毗 唎 俱 知
  誓 婆 毗 阇 耶
  跋 阇 啰 摩 礼 底
  毗 舍 嚧 多
  勃 腾 罔 迦
  跋 阇 啰 制 喝 那 阿 遮
  摩 啰 制 婆
  般 啰 质 多
  跋 阇 啰 擅 持
  毗 舍 啰 遮
  扇 多 舍
  鞞 提 婆
  补 视 多
  苏 摩 嚧 波
  摩 诃 税 多
  阿 唎 耶 多 啰
  摩 诃 婆 啰 阿 般 啰
  跋 阇 啰 商 揭 啰 制 婆
  跋 阇 啰 俱 摩 唎
  俱 蓝 陀 唎
  跋 阇 啰 喝 蕯 多 遮
  毗 地 耶
  乾 遮 那
  摩 唎 迦
  啒 苏 母
  婆 羯 啰 跢 那
  鞞 嚧 遮 那
  俱 唎 耶
  夜 啰 菟
  瑟 尼 钐
  毗 折 蓝 婆 摩 尼 遮
  跋 阇 啰 迦 那 迦 波 啰 婆
  嚧 阇 那
  跋 阇 啰 顿 稚 遮
  税 多 遮
  迦 摩 啰
  刹 奢 尸
  波 啰 婆
  翳 帝 夷 帝
  母 陀 啰
  羯 拏
  娑 鞞 啰 忏
  掘 梵 都
  印 兔 那 么 么 写
  乌 合牛
  唎 瑟 揭 拏
  般 剌 舍 悉 多
  蕯 怛 他
  伽 都 瑟 尼 钐
  虎 合牛 都 嚧 雍
  瞻 婆 那
  虎 合牛 都 嚧 雍
  悉 耽 婆 那
  虎 合牛 都 嚧 雍
  波 啰 瑟 地 耶
  三 般 叉
  拏 羯 啰
  虎 合牛 都 嚧 雍
  蕯 婆 药 叉
  喝 啰 刹 娑
  揭 啰 诃 若 阇
  毗 腾 崩 蕯 那 羯 啰
  虎 合牛 都 嚧 雍
  者 都 啰
  尸 底 南
  揭 啰 诃
  娑 诃 蕯 啰 南
  毗 腾 崩 蕯 那 啰
  虎 合牛 都 嚧 雍
  啰 叉
  婆 伽 梵
  蕯 怛 他
  伽 都 瑟 尼 钐
  波 啰 点
  阇 吉 唎
  摩 诃 娑 诃 蕯 啰
  勃 树 娑 诃 蕯 啰
  室 唎 沙
  俱 知 娑 诃 蕯 泥
  帝 隷 阿 弊 提 视 婆 唎 多
  吒 吒 甖 迦
  摩 诃 跋 阇 嚧 陀 啰
  帝 唎 菩 婆 那
  曼 茶 啰
  乌 合牛
  莎 悉 帝
  薄 婆 都
  么 么
  印 兔 那 么 么 写
  啰 阇 婆 夜
  主 啰 跋 夜
  阿 祇 尼 婆 夜
  乌 陀 迦 婆 夜
  毗 沙 婆 夜
  舍 蕯 多 啰 婆 夜
  婆 啰 斫 羯 啰 婆 夜
  突 瑟 叉 婆 夜
  阿 舍 你 婆 夜
  阿 迦 啰
  密 唎 柱 婆 夜
  陀 啰 尼 部 弥 剑
  波 伽 波 陀 婆 夜
  乌 啰 迦 婆 多 婆 夜
  剌 阇 坛 茶 婆 夜
  那 伽 婆 夜
  毗 条 怛 婆 夜
  苏 波 啰 拏 婆 夜
  药 叉 揭 啰 诃
  啰 叉 私 揭 啰 诃
  毕 唎 多 揭 啰 诃
  毗 舍 遮 揭 啰 诃
  部 多 揭 啰 诃
  鸠 盘 茶 揭 啰 诃
  补 单 那 揭 啰 诃
  迦 吒 补 丹 那 揭 啰 诃
  悉 乾 度 揭 啰 诃
  阿 播 悉 摩 啰 揭 啰 诃
  乌 檀 摩 陀 揭 啰 诃
  车 夜 揭 啰 诃
  醯 唎 婆 帝 揭 啰 诃
  社 多 诃 唎 南
  揭 婆 诃 唎 南
  嚧 地 啰 诃 唎 南
  忙 娑 诃 唎 南
  谜 陀 诃 唎 南
  摩 阇 诃 唎 南
  阇 多 诃 唎 女
  视 比 多 诃 唎 南
  毗 多 诃 唎 南
  婆 多 诃 唎 南
  阿 输 遮 诃 唎 女
  质 多 诃 唎 女
  帝 钐 蕯 鞞 钐
  蕯 婆 揭 啰 诃 南
  毗 陀 耶 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  波 唎 跋 啰 者 迦
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  茶 演 尼
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  摩 诃 般 输 般 怛 夜
  嚧 陀 啰
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  那 啰 夜 拏
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  怛 埵 伽 嚧 茶 西
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  摩 诃 迦 啰
  摩 怛 唎 伽 拏
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  迦 波 唎 迦
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  阇 夜 羯 啰
  摩 度 羯 啰
  蕯 婆 啰 他 娑 达 那
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  赭 咄 啰
  婆 耆 你
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  毗 唎 羊 讫 唎 知
  难 陀 鸡 沙 啰
  伽 拏 般 帝
  索 醯 夜
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  那 揭 那 舍 啰 婆 拏
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  阿 罗 汉
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  毗 多 啰 伽
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  跋 阇 啰 波 你
  具 醯 夜 具 醯 夜
  迦 地 般 帝
  讫 唎 担
  毗 陀 夜 阇
  嗔 陀 夜 弥
  鸡 啰 夜 弥
  啰 叉 罔
  婆 伽 梵
  印 兔 那 么 么 写
  婆 伽 梵
  蕯 怛 多 般 怛 啰
  南 无 粹 都 帝
  阿 悉 多 那 啰 剌 迦
  波 啰 婆
  悉 普 咤
  毗 迦 蕯 怛 多 钵 帝 唎
  什 佛 啰 什 佛 啰
  陀 啰 陀 啰
  频 陀 啰 频 陀 啰
  嗔 陀 嗔 陀
  虎 合牛 虎 合牛
  泮 吒 泮 吒 泮 吒 泮 吒 泮 咤
  娑 诃
  醯 醯 泮
  阿 牟 迦 耶 泮
  阿 波 啰 提 诃 多 泮
  婆 啰 波 啰 陀 泮
  阿 素 啰
  毗 陀 啰
  波 迦 泮
  蕯 婆 提 鞞 弊 泮
  蕯 婆 那 伽 弊 泮
  蕯 婆 药 叉 弊 泮
  蕯 婆 乾 闼 婆 弊 泮
  蕯 婆 补 丹 那 弊 泮
  迦 吒 补 丹 那 弊 泮
  蕯 婆 突 狼 枳 帝 弊 泮
  蕯 婆 突 涩 比 犁
  讫 瑟 帝 弊 泮
  蕯 婆 什 婆 犁 弊 泮
  蕯 婆 阿 播 悉 摩 犂 弊 泮
  蕯 婆 舍 啰 婆 拏 弊 泮
  蕯 婆 地 帝 鸡 弊 泮
  蕯 婆 怛 摩 陀 继 弊 泮
  蕯 婆 毗 陀 耶
  啰 誓 遮 犂 弊 泮
  阇 夜 羯 啰
  摩 度 羯 啰
  蕯 婆 啰 他 娑 陀 鸡 弊泮
  毗 地 夜
  遮 唎 弊 泮
  者 都 啰
  缚 耆 你 弊 泮
  跋 阇 啰
  俱 摩 唎
  毗 陀 夜
  啰 誓 弊 泮
  摩 诃 波 啰 丁 羊
  乂 耆 唎 弊 泮
  跋 阇 啰 商 羯 啰 夜
  波 啰 丈 耆 啰 阇 耶 泮
  摩 诃 迦 啰 夜
  摩 诃 末 怛 唎 迦 拏
  南 无 娑 羯 唎 多 夜 泮
  毖 瑟 拏 婢 曳 泮
  勃 啰 诃 牟 尼 曳 泮
  阿 耆 尼 曳 泮
  摩 诃 羯 唎 曳 泮
  羯 啰 檀 持 曳 泮
  蔑 怛 唎 曳 泮
  唠 怛 唎 曳 泮
  遮 文 茶 曳 泮
  羯 逻 啰 怛 唎 曳 泮
  迦 般 唎 曳 泮
  阿 地 目 质 多
  迦 尸 摩 舍 那
  婆 私 你 曳 泮
  演 吉 质
  蕯 埵 婆 写
  么 么 印 兔 那 么 么 写
  突 瑟 吒 质 多
  阿 末 怛 唎 质 多
  乌 阇 诃 啰
  伽 婆 诃 啰
  嚧 地 啰 诃 啰
  婆 娑 诃 啰
  摩 阇 诃 啰
  阇 多 诃 啰
  视 毖 多 诃 啰
  跋 略 夜 诃 啰
  乾 陀 诃 啰
  布 史 波 诃 啰
  颇 啰 诃 啰
  婆 写 诃 啰
  般 波 质 多
  突 瑟 咤 质 多
  唠 陀 啰 质 多
  药 叉 揭 啰 诃
  啰 刹 娑 揭 啰 诃
  闭 隷 多 揭 啰 诃
  毗 舍 遮 揭 啰 诃
  部 多 揭 啰 诃
  鸠 盘 茶 揭 啰 诃
  悉 乾 陀 揭 啰 诃
  乌 怛 摩 陀 揭 啰 诃
  车 夜 揭 啰 诃
  阿 播 蕯 摩 啰 揭 啰 诃
  宅 袪 革
  茶 耆 尼 揭 啰 诃
  唎 佛 帝 揭 啰 诃
  阇 弥 迦 揭 啰 诃
  舍 俱 尼 揭 啰 诃
  姥 陀 啰
  难 地 迦 揭 啰 诃
  阿 蓝 婆 揭 啰 诃
  乾 度 波 尼 揭 啰 诃
  什 伐 啰
  堙 迦 醯 迦
  坠 帝 药 迦
  怛 隷 帝 药 迦
  者 突 讬 迦
  昵 提 什 伐 啰
  毖 钐 摩 什 伐 啰
  薄 底 迦
  鼻 底 迦
  室 隷 瑟 密 迦
  娑 你 般 帝 迦
  蕯 婆 什 伐 啰
  室 嚧 吉 帝
  末 陀 鞞 达 嚧 制 剑
  阿 绮 嚧 钳
  目 佉 嚧 钳
  羯 唎 突 嚧 钳
  揭 啰 诃
  揭 蓝 羯 拏 输 蓝
  惮 多 输 蓝
  迄 唎 夜 输 蓝
  末 么 输 蓝
  跋 唎 室 婆 输 蓝
  毖 栗 瑟 吒 输 蓝
  乌 陀 啰 输 蓝
  羯 知 输 蓝
  跋 悉 帝 输 蓝
  邬 嚧 输 蓝
  常 伽 输 蓝
  喝 悉 多 输 蓝
  跋 陀 输 蓝
  娑 房 盎 伽
  般 啰 丈 伽 输 蓝
  部 多 毖 跢 茶
  茶 耆 尼
  什 婆 啰
  陀 突 嚧 迦
  建 咄 嚧 吉 知
  婆 路 多 毗
  蕯 般 嚧
  诃 凌 伽
  输 沙 怛 啰
  娑 那 羯 啰
  毗 沙 喻 迦
  阿 耆 尼
  乌 陀 迦
  末 啰 鞞 啰
  建 跢 啰
  阿 迦 啰
  密 唎 咄
  怛 敛 部 迦
  地 栗 剌 咤
  毖 唎 瑟 质 迦
  蕯 婆 那 俱 啰
  肆 引 伽 弊
  揭 啰 唎 药 叉
  怛 啰 刍
  末 啰 视
  吠 帝 钐
  娑 鞞 钐
  悉 怛 多 钵 怛 啰
  摩 诃 跋 阇 嚧
  瑟 尼 钐
  摩 诃 般 赖 丈 耆 蓝
  夜 波 突 陀
  舍 喻 阇 那
  辫 怛 隷 拏
  毗 陀 耶
  盘 昙 迦 嚧 弥
  帝 殊
  盘 昙 迦 嚧 弥
  般 啰 毗 陀
  盘 昙 迦 嚧 弥
  跢 侄 他
  唵
  阿 那 隶
  毗 舍 提
  鞞 啰
  跋 阇 啰
  陀 唎
  盘 陀 盘 陀 你
  跋 阇 啰 谤 尼 泮
  虎 合牛 都 嚧 甕 泮
  莎 婆 诃
  般若波若密多心经
  观自在菩萨 行深般若波罗蜜多时
  照见五蕴皆空
  度一切苦厄
  舍利子 色不异空 空不异色
  色即是空 空即是色
  受想行识 亦复如是
  舍利子 是诸法空相
  不生不灭 不垢不净 不增不减
  是故空中无色 无受想行识
  无眼耳鼻舌身意 无色香声味触法
  无眼界 乃至无意识界
  无无明 亦无无明尽
  乃至无老死 亦无老死尽
  无苦集灭道 无智亦无得
  以无所 得故 菩提 萨埵
  依 般若 波罗 蜜多 故
  心 无挂 碍 无 挂碍故
  无有恐怖 远离颠倒梦想 究竟涅盘
  三世 诸佛 依般 若波 罗蜜 多故
  得阿 耨多 罗三 藐三 菩提
  故知 般若 波罗 蜜多
  是大 神咒 是大 明咒
  是 无上 咒 是无 等等 咒
  能除 一切 苦 真实 不虚
  故 说般 若波 罗蜜 多咒 即说 咒曰
  揭 谛 揭 谛 波罗 揭谛

  `,
  "tip": `
在佛教里头，《楞严咒》是最重要的一部咒，是咒中之王，也是咒里边最长的一个咒，这个咒关系着整个佛教的兴衰。《楞严咒》是支持着天地没有毁灭的灵文，《楞严咒》是支持世界不到末日的灵文。所以我常说，世界上若有一人会念《楞严咒》，这世界就不会毁灭，佛法也不会毁灭的。等到世上没有人会念《楞严咒》时，这个世界就快毁灭了，因为正法不存在了。
  
[楞严咒的作用]

1.化解业障：
业障是每个人修行过程中必须面对的难题。而佛教认为，念佛祈福、念经诵咒就能消除业障。楞严咒就拥有通达因果、洞彻真理、化除障碍的神奇力量，所以常常被用于念经斋戒、放生、祈福等诸多方面的修行之中。
2.祈愿守护：
楞严咒还可以用于祈求守护和庇佑，平息心灵。它能够让人们感受到佛祖的指引和庇佑，减轻精神压力、消解妄念，增强信仰和勇气，使生活更加充实和有意义。
3.提升修行境界：
楞严咒的咒音强大而深沉，能够引导修行者快速进入冥想状态。通过反复地念诵，“一念不生，万法皆空”，修行者能够脱离眼前的纷扰、烦恼和欲望，抵达境界的高处。

[楞严咒引导]

南无楞严会上佛菩萨
南无楞严会上佛菩萨
南无楞严会上佛菩萨
妙湛总持不动尊 首楞严王世希有
销我亿劫颠倒想 不历僧祗获法身
愿今得果成宝王 还度如是恒沙众
将此深心奉尘刹 是则名为报佛恩
伏请世尊为证明 五浊恶世誓先入
如一众生未成佛 终不于此取泥洹
大雄大力大慈悲 希更审除微细惑
令我早登无上觉 于十方界坐道场
舜若多性可销亡 烁迦罗心无动转
南无常住十方佛
南无常住十方法
南无常住十方僧
南无释迦牟尼佛
南无佛顶首楞严
南无观世音菩萨
南无金刚藏菩萨
尔时世尊 从肉髻中 涌百宝光
光中涌出 千叶宝莲 有化如来
坐宝华中 顶放十道 百宝光明
一一光明 皆遍示现 十恒河沙
金刚密迹 擎山持杵 遍虚空界
大众仰观 畏爱兼抱 求佛哀佑
一心听佛 无见顶相 放光如来 宣说神咒
  `,
}
