window.__buddhism_sutra = {
  "text": `佛经与咒言  从本质上说  都是佛教的修行法门
其目的都是 教世人如何 出离世间苦海  成就佛道  

"咒言" 并不是佛教的发明  而是古印度社会传统的产物  
也就是说 在古印度 持"咒"的教派很普遍 
佛教本身也是在这样的基础上 才有持"咒"这一说法  
  
而佛教中的"咒"与"经"的不同  
往往表现在以下这三个方面  

一是"咒"其实是"经"的浓缩版  也是"经"的精华所在  
在佛教中  常有一种说法  即六百卷的般若经  其精华都浓缩在一部名叫《无量寿经》当中  
而《无量寿经》的精华都浓缩在一句佛号当中  即阿弥陀佛  
  
二是佛教中的"咒"往往是音译  而不同于"经"的意译  
因为"咒言"一旦意译  其意尽失  无法表达其原有的丰富内涵  
这也是译师们在译经时  遇到"咒"往往不直译的真正原因  
  
三是相对于"咒"而言  "经"更像是"咒"的传  即诠释  
因此  念经和念咒或持咒和持咒并不是完全相同  因为"咒"的本身含有更多丰富的内容  
这是"经"无法比拟的  甚至可以说  
一部"经"只是诠释"咒"的一种角度  有多部"经"就是多种角度  
  `,
  "tip": "",
}